Revit 2024 API
BuiltInFailures.DPartFailures.DeletingDPartWillDeleteAllPartsWarning Property
 Deleting a Part will delete all associated Parts and the original Element will be made visible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DeletingDPartWillDeleteAllPartsWarning { get; }
Visual Basic
Public Shared ReadOnly Property DeletingDPartWillDeleteAllPartsWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DeletingDPartWillDeleteAllPartsWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace